# üß™ Exercise 2: VLANs and Trunking

**Goal:** Segment the network using VLANs and configure trunk links.  

**Topology:** Use the topology from Exercise 1, focusing on SW1.  

**Scenario:** Separate users on SW1 into Sales (VLAN 10) and Tech (VLAN 20).

---

## üîß Configuration: SW1

### 1. Create VLANs


### ‚úÖ Assign Ports to VLANs

**Assumptions:**

- **PC1**  
  - IP Address: `192.168.10.10`  
  - Connected to: `Fa0/1`  
  - Assigned to: **VLAN 10 (Sales)**

- **PC2**  
  - Old IP Address: `192.168.10.11`  
  - New IP Address: `192.168.30.10`  
  - Connected to: `Fa0/2`  
  - Assigned to: **VLAN 20 (Tech)**

**Switch Configuration:**

```bash
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int  f0/1
Switch(config-if)#sw mode ac
Switch(config-if)#sw ac vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if)#vlan 10
Switch(config-vlan)#name sales
Switch(config-vlan)#do sh vlan
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/3, Fa0/4, Fa0/5, Fa0/6
                                                Fa0/7, Fa0/8, Fa0/9, Fa0/10
                                                Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/23, Fa0/24, Gig0/1, Gig0/2
10   sales                            active    Fa0/1
20   tech                             active    Fa0/2
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active 

```
---
### ‚úÖ Configure Trunk Link (SW1 to R1 via Gi0/0)

This trunk link allows multiple VLANs (e.g., VLAN 10 and VLAN 20) to be carried over a single physical connection between **SW1** and **R1**.

**Switch Configuration:**

```bash
SW1(config)# interface gig0/0
SW1(config-if)# switchport mode trunk
SW1(config-if)# exit
```
### üõ†Ô∏è Update PC2's IP Configuration

> ‚ö†Ô∏è This step is performed **on PC2**, not on the switch.

Update PC2‚Äôs IP settings to match the new VLAN 20 subnet.

| PC   | Old IP         | New IP         | Subnet Mask     | Gateway               |
|------|----------------|----------------|------------------|------------------------|
| PC2  | 192.168.10.11  | 192.168.30.10  | 255.255.255.0   | 192.168.30.1 *(placeholder)* |

---
### üîç Check VLANs and Port Assignments

Use the following command on **SW1** to verify VLAN creation and port assignments:

```bash
SW1# show vlan brief
```

## Output üéØ

```
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/3, Fa0/4, ... (other ports)
10   Sales                            active    Fa0/1
20   Tech                             active    Fa0/2

```

---
### üîç Check Trunk Status

Use the following command on **SW1** to verify the trunk configuration on interface **Gi0/0**:

```bash
SW1# show interfaces trunk
```
## Output üéØ

```bash
 Switch#show interfaces trunk 
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gig0/1      10,20

Port        Vlans allowed and active in management domain
Gig0/1      10,20

Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      none
```

---

### ‚ùå Connectivity Test Results

- **PC1** ‚ùå cannot ping **PC2**  
  *(Inter-VLAN routing is not yet configured)*

- **PC1** ‚ùå cannot ping its default gateway `192.168.10.1`  
  *(Router interface is not VLAN-aware yet)*

---

![Screenshot 2025-04-22 192628](https://github.com/user-attachments/assets/d3dd5e33-d270-4ef7-8f08-e9403d89c4c8)

